/*平均分问题:通过键盘输入3名学生4门课程的成绩，分别求每个学生的平均成绩和每门课程的平均成绩。要求所有成绩均放入一个4行5列的数组中，输入时同一人数据间用空格,不同人用回车其中最后一列和最后一行分别放每个学生的平均成绩、每门课程的平均成绩及班级总平均分。*/
#include<stdio.h>
#include<stdlib.h>
int main()                                //主程序从main()开始
{
	float a[4][5], sum1, sum2;            //定义浮点型变量4行5列的数组a、sum1、sum2
	int i, j;                             //定义整型变量i、j，便于对数组进行处理
	for (i = 0;i < 3;i++)                 //条件循环语句：i初始值为0；i小于3；每次循环后i加1
		for (j = 0;j < 4;j++)             //条件循环语句：j初始值为0；j小于4；每次循环后j加1（以上2个条件循环语句确定如何输入3名学生4门课程）
			scanf_s("%f", &a[i][j]);      //a数组的初始数据应当从外界输入
	for (i = 0;i < 3;i++) {               //条件循环语句：i初始值为0；i小于3；每次循环后i加1
		sum1 = 0;                         //sum1的初始值设置为0
		for (j = 0;j < 4;j++)             //条件循环语句：j初始值为0；j小于4；每次循环后j加1
			sum1 += a[i][j];              //新的sum1值赋为旧的sum1的值加上数组a第i行第j列的数字的值
			a[i][4] = sum1 / 4;           //第i行第4（+1）列的值为sum1除以4的值

	}
	for (j = 0;j < 5;j++) {               //条件循环语句：j初始值为0；j小于5；每次循环后j加1
		sum2 = 0;                         //sum2的初始值设置为0
		for (i = 0;i < 3;i++)             //条件循环语句求平均值（方法同上）
			sum2 += a[i][j];
			a[3][j] = sum2 / 3;
	}
	for (i = 0;i < 4;i++) {
		for (j = 0;j < 5;j++)
			printf("%6.2f", a[i][j]);     //输出六位数字，小数点后2位
			printf("\n");                 //换行输出
	}
	system("pause");                      //中止程序
	return 0;                             //结束程序
}