/*解决古典问题：有一对兔子，从出生后第3个月起每个月都生一对兔子，小兔子长到第3个月后每个月又生一对兔子，假如兔子都不死，问每个月的兔子总数是多少？*/
#include<stdio.h>
#include<stdlib.h>
int main()                                //主程序从main()开始
{
	long f1, f2;                          //设置2个长整型变量f1、f2（数据较大）
	int i;                                //设置一个整型变量i用于设定for语句的循环
	f1 = f2 = 1;                          //初始f1、f2赋值为1
	for (i = 1;i <= 20;i++) {             //条件循环语句：i初始赋值为1，对于i小于等于20时，每次循环i加1
		printf("%12ld%12ld", f1, f2);     //输出f1、f2
		if (i % 2 == 0)printf("\n");      //条件语句：如果i为2的倍数换行
		f1 = f1 + f2;                     //新的f1赋值为旧的f1和f2的和
		f2 = f1 + f2;                     //新的f2赋值为旧的f2和f1的和
	}
	system("pause");                      //中止程序
	return 0;                             //结束程序
}