/*探究printf()的用法*/
#include<stdio.h>                                                   //由于printf()函数是一个标准库函数，因此使用时要在程序开头加上#include<stdio.h>
#include<stdlib.h>
int main()                                                          //主程序从main()开始
{
	int x = 1234;                                                   //定义整型变量x的值为1234
	float f = 123.456;                                              //定义单精度浮点型变量f的值为123.456
	double m = 123.456;                                             //定义双精度浮点型变量m的值为123.456
	char ch = 'a';                                                  //定义字符串型变量ch的值为a
	char a[] = "Hello World!";                                      //定义字符串型a数组
	int y = 3, z = 4;                                               //定义整型变量y、z的值分别为3、4
	printf("%d%d\n", y, z);                                         //将y、z的值按照十进制整数输出即输出结果为34
	printf("y=%d,z=%d\n", y, z);                                    //在上一种（行12）的相同输出方式下加入对于数值对应变量名的注释
	printf("%8d,%2d\n",x, x);                                       //分别按照位宽为8位、2位来输出x的数值（x数值位宽为4位，因此前一个1234前面空4格，后一个1234不空）
	printf("%f,%8f,%8.1f,%.2f,%.2e\n", f, f, f, f, f);              //分别按照常规浮点输出、数据最小宽度为8输出、数据最小宽度为8且保留小数点后1位、保留小数点后2位、以指数形式输出保留两位小数形式输出f的数值
	printf("%lf\n", m);                                             //指定double型精度输出m
	printf("%3c\n", ch);                                            //以3位宽输出ch即“a”前空2格
	printf("%s\n%15s\n%10.5s\n%2.5s\n%.3s\n", a, a, a, a, a);       //分别按照常规字符串、15位位宽（右侧对齐）、输出5位且总位宽10位且右端对齐、输出5位位宽2位、3位位宽输出a[]（同时每次输出后换行）
	system("pause");                                                //中止程序
	return 0;                                                       //结束程序
}